using System;
using System.Collections.Generic;

//У вас есть множество целых чисел. Каждое целое число - это сумма покупки.

//Вам нужно обслуживать клиентов до тех пор, пока очередь не станет пуста. 

//После каждого обслуженного клиента деньги нужно добавлять на наш счёт и выводить его в консоль.  

//После обслуживания каждого клиента программа ожидает нажатия любой клавиши, после чего затирает 
//консоль и по новой выводит всю информацию, только уже со следующим клиентом

public class MainClass
{
    public static void Main()
    {
        int a = 10;

        int b = 38;

        int c = (31 - 5 * a) / b;

        Console.WriteLine(c);


    } 
}

        
